Laboratorium 2 Jakub Bilski

In [2]:
import psycopg2 as pg
import pandas as pd
from sqlalchemy import create_engine

Zadanie 1

In [3]:
# db_string = "postgresql://wbauer_adb:adb2020@pgsql-196447.vipserv.org:5432/wbauer_adb"

# db = create_engine(db_string)

# connection_sqlalchemy = db.connect()

# result_set = db.execute("SELECT * FROM city")
# for r in result_set:
#     print(r)
connection = pg.connect(host='pgsql-196447.vipserv.org', port='5432', dbname='wbauer_adb', user='wbauer_adb', password='adb2020')

df1 = pd.read_sql('select * from category', con=connection)
print("Ilość kategori filmów: {0}".format(df1.shape[0]))

Ilość kategori filmów: 16

Zadanie 2

In [4]:
df2 = pd.read_sql('select name from category order by name ASC', con=connection)

print(df2)

           name
0        Action
1     Animation
2      Children
3      Classics
4        Comedy
5   Documentary
6         Drama
7        Family
8       Foreign
9         Games
10       Horror
11        Music
12          New
13       Sci-Fi
14       Sports
15       Travel

Zadanie 3

In [46]:
df3a = pd.read_sql('SELECT title ,release_year FROM film ORDER BY release_year ASC OFFSET 999', con=connection)

print("Najstarszy film to: {0}\n".format(df3a))

df3b = pd.read_sql('SELECT title, release_year FROM film ORDER BY release_year ASC LIMIT 1', con=connection)

print("Najmłodszy film to: {0}".format(df3b))

Najstarszy film to:        title  release_year
0  Zorro Ark          2006

Najmłodszy film to:              title  release_year
0  Chamber Italian          2006

Zadanie 4

In [6]:
df4 = pd.read_sql("SELECT rental_date FROM rental WHERE rental_date BETWEEN '2005-07-01' and '2005-08-01'", con=connection)

print(df4)

             rental_date
0    2005-07-05 22:49:24
1    2005-07-05 22:51:44
2    2005-07-05 22:56:33
3    2005-07-05 22:57:34
4    2005-07-05 22:59:53
...                  ...
6704 2005-07-31 23:40:35
6705 2005-07-31 23:42:33
6706 2005-07-31 23:43:04
6707 2005-07-31 23:49:54
6708 2005-07-31 23:57:43

[6709 rows x 1 columns]

Zadanie 5

In [7]:
df5 = pd.read_sql("SELECT rental_date FROM rental WHERE rental_date BETWEEN '2010-01-01' and '2011-02-01'", con=connection)

print(df5)

Empty DataFrame
Columns: [rental_date]
Index: []

Zadanie 6

In [8]:
df6 = pd.read_sql('select amount from payment order by amount ASC offset 14595', con=connection)

print(df6)

   amount
0   11.99

Zadanie 7

In [53]:
df7 = pd.read_sql("SELECT first_name, last_name FROM customer WHERE customer.address_id IN (SELECT address.address_id FROM address WHERE address.city_id IN (SELECT country_id FROM country WHERE country = 'Poland' or country = 'Bangladesh' or country = 'Nigeria'))", con=connection)


print(df7)

  first_name last_name
0      Sonia   Gregory
1      Helen    Harris
2    Lillian   Griffin

Zadanie 8

In [10]:
df8 = pd.read_sql('SELECT country, country_id FROM country WHERE country_id IN (SELECT country_id FROM city WHERE city_id IN (SELECT city_id FROM address WHERE address_id IN (SELECT address_id FROM staff)))', con=connection)

print(df8)

     country  country_id
0  Australia           8
1     Canada          20

Zadanie 9

In [20]:
df9 = pd.read_sql("SELECT s.first_name, s.last_name FROM staff s INNER JOIN address a ON a.address_id = s.address_id INNER JOIN city c ON c.city_id = a.city_id INNER JOIN country  ON country.country_id = c.country_id WHERE country.country = 'Argentina' or country.country = 'Spain' ", con=connection)

print(df9)

Empty DataFrame
Columns: [first_name, last_name]
Index: []

Zadanie 10

In [24]:
df10 = pd.read_sql("SELECT DISTINCT c.name FROM category c INNER JOIN film_category f ON c.category_id = f.category_id INNER JOIN film ON f.film_id = film.film_id INNER JOIN inventory i ON film.film_id = i.film_id INNER JOIN rental r ON i.inventory_id = r.inventory_id", con=connection)

print(df10)

           name
0        Sports
1      Classics
2           New
3        Family
4        Comedy
5     Animation
6        Travel
7         Music
8         Drama
9        Horror
10       Sci-Fi
11        Games
12  Documentary
13      Foreign
14       Action
15     Children

Zadanie 11

In [31]:
df11 = pd.read_sql("SELECT DISTINCT c.name FROM category c INNER JOIN film_category f ON c.category_id = f.category_id INNER JOIN film ON f.film_id = film.film_id INNER JOIN inventory i ON film.film_id = i.film_id INNER JOIN rental r ON i.inventory_id = r.inventory_id INNER JOIN staff s ON r.staff_id = s.staff_id INNER JOIN store ON s.store_id = store.store_id INNER JOIN address a ON store.address_id = a.address_id INNER JOIN city ON a.city_id = city.city_id INNER JOIN country ON city.country_id = country.country_id WHERE country.country = 'USA'", con=connection)

print(df11)

Empty DataFrame
Columns: [name]
Index: []

Zadanie 12

In [33]:
df12 = pd.read_sql("SELECT f.title FROM film f INNER JOIN film_actor ON f.film_id = film_actor.film_id INNER JOIN actor a ON film_actor.actor_id = a.actor_id WHERE (a.first_name = 'Olympia' and a.last_name = 'Pfeiffer') or  (a.first_name = 'Julia' and a.last_name = 'Zellweger') or (a.first_name = 'Ellen' and a.last_name = 'Presley')", con=connection)

print(df12)

                title
0     Bilko Anonymous
1   Caribbean Liberty
2    Casper Dragonfly
3    Empire Malkovich
4       Floats Garden
..                ...
64       Outlaw Hanky
65    Panky Submarine
66   Rider Caddyshack
67          Won Dares
68      Wyoming Storm

[69 rows x 1 columns]